"""
В диапазоне натуральных чисел от 2 до 99 определить, сколько из них кратны каждому из чисел в диапазоне от 2 до 9.
"""
my_array = [_ for _ in range(2, 100)]
print(my_array)
a_2 = 0
a_3 = 0
a_4 = 0
a_5 = 0
a_6 = 0
a_7 = 0
a_8 = 0
a_9 = 0
for i in my_array:
    if i % 2 == 0:
        a_2 += 1
    if i % 3 == 0:
        a_3 += 1
    if i % 4 == 0:
        a_4 += 1
    if i % 5 == 0:
        a_5 += 1
    if i % 6 == 0:
        a_6 += 1
    if i % 7 == 0:
        a_7 += 1
    if i % 8 == 0:
        a_8 += 1
    if i % 9 == 0:
        a_9 += 1
print(f'В данном массиве количество элементов кратных:\n2-м - {a_2}\n3-м - {a_3}\n4-м - {a_4}\n5-ти - {a_5}\n6-ти - {a_6}\n7-ти - {a_7}\n'
      f'8-ти - {a_8}\n9-ти - {a_9}\n')
