"""
https://drive.google.com/file/d/1qn2Yhy2lSxRgGST_Oqvro2uPVHJSapW5/view?usp=sharing
Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
"""
print(chr(97))
a = int(input('Введите порядковый буквы в алфавите от 1 до 26: '))
print(f'Выбранная буква "{chr(96+a)}"')
